---
kind: method
id: M:Autodesk.Revit.DB.Structure.Truss.TogglePinMember(Autodesk.Revit.DB.ElementId)
zh: 桁架
source: html/675dc4a6-ee96-22d5-367e-ed2b44d8562d.htm
---
# Autodesk.Revit.DB.Structure.Truss.TogglePinMember Method

**中文**: 桁架

Pin/Unpin a truss member.

## Syntax (C#)
```csharp
public void TogglePinMember(
	ElementId elemId
)
```

## Parameters
- **elemId** (`Autodesk.Revit.DB.ElementId`) - The member element is going to pin/unpin.